'use client';

import React from 'react';
import Link from 'next/link';

const Footer = () => {
  return (
    <footer className="bg-[#1A171B] text-white px-4 md:px-10 lg:px-20 py-10">
      <div className="max-w-[1400px] mx-auto flex flex-col">
        {/* Верхний блок: Лого + кнопка "Наверх" */}
        <div className="flex items-center justify-between  pb-5">
          {/* Лого */}
          <div>
            <svg
              width="78"
              height="24"
              viewBox="0 0 78 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path d="M3.57521 23.9964H0V0H3.57521V23.9964Z" fill="#fff" />
              <path
                d="M42.3295 18.3575H36.5029V23.9964H32.9277V14.7858H40.0782L32.9277 3.53629V0.00354004H41.3702C46.4321 0.00354004 50.5383 4.10973 50.5383 9.17167C50.5383 12.623 48.641 15.6248 45.8056 17.1823L50.1525 24H45.933L42.3295 18.361V18.3575ZM43.8905 14.1522C45.7065 13.2495 46.9631 11.3487 46.9631 9.16814C46.9631 6.0708 44.4675 3.57167 41.3702 3.57167H37.172L43.8905 14.1487V14.1522Z"
                fill="#fff"
              />
              <path
                d="M66.108 0C59.6054 0 54.3027 5.37345 54.3027 11.9717C54.3027 18.5699 59.6054 23.9929 66.108 23.9929C72.6107 23.9929 77.9169 18.6195 77.9169 12.0212C77.9169 5.42301 72.6107 0 66.108 0ZM66.108 20.4212C64.4266 20.4212 62.8691 19.915 61.5735 19.0265C61.5735 19.0265 60.0478 18.0319 59.1558 16.4566C58.3346 15.1611 57.8815 13.6248 57.8815 11.9717C57.8815 7.34159 61.5771 3.57168 66.1116 3.57168C67.7894 3.57168 69.4886 4.12743 70.6425 4.96637C71.8071 5.81239 72.2638 6.24424 73.0708 7.53274C73.9062 8.95929 74.3452 10.3646 74.3452 12.0212C74.3452 16.6478 70.6709 20.4212 66.1116 20.4212H66.108Z"
                fill="#fff"
              />
              <path
                d="M18.5167 0H13.6707V3.57522H18.5167C19.3379 3.57522 20.1025 3.74868 20.7963 4.05664C20.7963 4.05664 21.7025 4.4531 22.3468 5.09026C23.2777 6.00708 23.4087 6.47788 23.4087 6.47788C23.8689 7.27434 24.1096 8.18761 24.1096 9.17168C24.1096 12.2655 21.6105 14.7858 18.5167 14.7858H10.0742V23.9964H13.6423V18.3575H18.5167C23.5786 18.3575 27.6813 14.2301 27.6813 9.16815C27.6813 4.1062 23.5786 0 18.5167 0Z"
                fill="#fff"
              />
            </svg>
          </div>

          {/* Кнопка "Наверх" */}
          <button
            onClick={() => window.scrollTo({ top: 0, behavior: 'smooth' })}
            className="text-sm text-white flex gap-[11px] items-center px-4 py-2 cursor-pointer"
          >
            Наверх{' '}
            <svg
              width="10"
              height="7"
              viewBox="0 0 10 7"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M5.16535 0.772641L8.96033 4.56763C9.21147 4.84667 9.21147 5.26523 8.96033 5.51637L8.31853 6.15817C8.0674 6.40931 7.62093 6.40931 7.36979 6.15817L4.69097 3.45145L1.98426 6.15817C1.73312 6.40931 1.31455 6.40931 1.03551 6.15817L0.421615 5.51637C0.142572 5.26523 0.142572 4.84667 0.421615 4.56763L4.2166 0.772641C4.46774 0.521502 4.8863 0.521502 5.16535 0.772641Z"
                fill="white"
              />
            </svg>
          </button>
        </div>

        {/* Средняя часть с колонками */}
        <div className="grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-4  border-b-2 border-white pb-[50px]">
          <div>
            <h3 className="font-semibold text-[14px] md:text-[16px]  mb-[30px] border-b-2 border-white pb-[12px]">
              ИНФОРМАЦИЯ
            </h3>
            <ul className="space-y-4 text-[14px] font-semibold">
              <li>
                <Link href="#">Главная</Link>
              </li>
              <li>
                <Link href="#">Каталог</Link>
              </li>
              <li>
                <Link href="#">Портфолио</Link>
              </li>
              <li>
                <Link href="#">Компетенции</Link>
              </li>
              <li>
                <Link href="#">Компания</Link>
              </li>
              <li>
                <Link href="#">Загрузки</Link>
              </li>
            </ul>
          </div>
          <div>
            <h3 className="font-semibold text-[14px] md:text-[16px] mb-[30px] mt-[25px] md:mt-0  border-b-2 border-white pb-[12px] ">
              ПРАВОВАЯ ИНФОРМАЦИЯ
            </h3>
            <ul className="space-y-4 text-[14px] font-semibold">
              <li>
                <Link href="#">Условия пользования сайтом</Link>
              </li>
              <li>
                <Link href="#">Файлы Cookie</Link>
              </li>
              <li>
                <Link href="#">Закупка</Link>
              </li>
            </ul>
          </div>
          <div>
            <h3 className="font-semibold text-[14px] md:text-[16px] mt-[25px] md:mt-0  mb-[30px] border-b-2 border-white pb-[12px]">
              ПРОДУКЦИЯ
            </h3>
            <ul className="space-y-4 text-[14px] font-semibold">
              <li>
                <Link href="#">Дорожное освещение</Link>
              </li>
              <li>
                <Link href="#">Архитектурное освещение</Link>
              </li>
              <li>
                <Link href="#">Ландшафтное освещение</Link>
              </li>
              <li>
                <Link href="#">Интерьерное освещение</Link>
              </li>
              <li>
                <Link href="#">Освещение для музеев</Link>
              </li>
              <li>
                <Link href="#">Художественное литье</Link>
              </li>
            </ul>
          </div>
          <div className="text-[14px]">
            <h3 className="font-semibold mb-[30px] border-b-2 text-[14px] md:text-[16px] mt-[25px] md:mt-0  border-white pb-[12px]">
              КОНТАКТЫ
            </h3>
            <div className="text-start md:text-end float-none md:float-end max-w-[254px] flex flex-col gap-5">
              <p className="font-semibold text-[14px]">
                117105, Москва, Новоданиловская набережная, д.6, к.1
              </p>
              <p className="font-semibold text-[14px]">+7 (499) 551-51-85</p>
              <p className="font-semibold text-[14px]">info@illumpro.ru</p>
            </div>
          </div>
        </div>

        {/* Нижняя часть */}
        <div className="flex justify-between text-[14px] items-center text-xs font-semibold text-white mt-6 gap-4">
          <div className="flex gap-4 items-center max-w-[195px] w-full">
            <Link href="#">
              <span>
                <svg
                  width="24"
                  height="21"
                  viewBox="0 0 24 21"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M21.9115 4.01796C21.5926 5.37331 18.7225 9.43937 18.7225 9.43937C18.4833 9.838 18.3637 10.0373 18.7225 10.4758C18.8819 10.6751 21.8717 13.5453 22.3102 14.9006C22.5095 15.5783 22.1906 15.8972 21.5129 15.8972H19.161C18.284 15.8972 18.0049 15.2195 16.4104 13.625C15.0152 12.2697 14.4172 12.0703 14.0585 12.0703C13.3409 12.0703 13.4605 12.3494 13.4605 15.0202C13.4605 15.5783 13.2612 15.8972 11.7863 15.8972C9.31473 15.8972 6.56416 14.4223 4.61086 11.6319C1.70084 7.52593 0.903575 4.45646 0.903575 3.81865C0.903575 3.45988 1.06303 3.14097 1.70084 3.14097H4.05278C4.65072 3.14097 4.8899 3.42001 5.12908 4.05783C6.28512 7.40634 8.19856 10.3562 8.99582 10.3562C9.31473 10.3562 9.43432 10.1968 9.43432 9.43937V5.97126C9.35459 4.37673 8.51746 4.25714 8.51746 3.69906C8.51746 3.42001 8.71678 3.14097 9.11541 3.14097H12.7828C13.3011 3.14097 13.4605 3.42001 13.4605 4.01796V8.68197C13.4605 9.16033 13.6997 9.35964 13.8193 9.35964C14.1382 9.35964 14.3774 9.16033 14.9355 8.64211C16.6097 6.72867 17.8056 3.81865 17.8056 3.81865C17.9651 3.45988 18.2441 3.14097 18.8421 3.14097H21.194C21.9115 3.14097 22.0311 3.5396 21.9115 4.01796Z"
                    fill="white"
                  />
                </svg>
              </span>
            </Link>
            <Link href="#">
              <span>
                <svg
                  width="20"
                  height="22"
                  viewBox="0 0 20 22"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M10.0048 0.633C15.466 0.633 19.8908 5.05783 19.8908 10.5191C19.8908 15.9804 15.466 20.4052 10.0048 20.4052C4.54348 20.4052 0.118652 15.9804 0.118652 10.5191C0.118652 5.05783 4.54348 0.633 10.0048 0.633ZM14.8282 7.40976C14.9877 6.77195 14.589 6.4929 14.1505 6.65236L4.62321 10.3198C3.98539 10.559 3.98539 10.9576 4.50362 11.117L6.93528 11.8745L12.5959 8.28675C12.8749 8.1273 13.1141 8.24689 12.9148 8.40634L8.33049 12.5521L8.17104 15.0635C8.41022 15.0635 8.52981 14.9439 8.6494 14.8243L9.8453 13.6683L12.3168 15.502C12.7952 15.7412 13.1141 15.6216 13.2337 15.0635L14.8282 7.40976Z"
                    fill="white"
                  />
                </svg>
              </span>
            </Link>
            <Link href="#">
              <span>
                <svg
                  width="24"
                  height="21"
                  viewBox="0 0 24 21"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M22.7521 4.29701C23.2305 5.97126 23.2305 9.55896 23.2305 9.55896C23.2305 9.55896 23.2305 13.1068 22.7521 14.8209C22.513 15.7776 21.7556 16.4952 20.8387 16.7344C19.1246 17.1729 12.3478 17.1729 12.3478 17.1729C12.3478 17.1729 5.53119 17.1729 3.81707 16.7344C2.90022 16.4952 2.14281 15.7776 1.90363 14.8209C1.42527 13.1068 1.42527 9.55896 1.42527 9.55896C1.42527 9.55896 1.42527 5.97126 1.90363 4.29701C2.14281 3.34029 2.90022 2.58288 3.81707 2.3437C5.53119 1.86534 12.3478 1.86534 12.3478 1.86534C12.3478 1.86534 19.1246 1.86534 20.8387 2.3437C21.7556 2.58288 22.513 3.34029 22.7521 4.29701ZM10.1155 12.7879L15.7761 9.55896L10.1155 6.33003V12.7879Z"
                    fill="white"
                  />
                </svg>
              </span>
            </Link>
          </div>
          <p>© 2008 - 2025, Все права защищены</p>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
